---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.GetAnalyticalSpaces
source: html/eeb905e6-83f4-2097-8fc8-7b1d6b976be3.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.GetAnalyticalSpaces Method

The collection of analytical spaces.

## Syntax (C#)
```csharp
public IList<EnergyAnalysisSpace> GetAnalyticalSpaces()
```

## Returns
Returns the analytical spaces after model calculation.